Tekla Open API Reference for Tekla Structures 2025
CylindricalSurfaceNode.AcceptVisitor Method
 Entry method for the visitor pattern
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override void AcceptVisitor(
	IGeometryNodeVisitor visitor
)
Public Overrides Sub AcceptVisitor (
	visitor As IGeometryNodeVisitor
)
Parameters
visitor
Type: Tekla.Structures.Model.IGeometryNodeVisitor
[Missing <param name="visitor"/> documentation for "M:Tekla.Structures.Model.CylindricalSurfaceNode.AcceptVisitor(Tekla.Structures.Model.IGeometryNodeVisitor)"]
Implements
IGeometryNode.AcceptVisitor(IGeometryNodeVisitor)
See Also
Reference
CylindricalSurfaceNode Class
Tekla.Structures.Model Namespace